getantidote/use-omz
ohmyzsh/ohmyzsh path:lib/directories.zsh
ohmyzsh/ohmyzsh path:lib/history.zsh
ohmyzsh/ohmyzsh path:lib/completion.zsh
ohmyzsh/ohmyzsh path:lib/key-bindings.zsh
ohmyzsh/ohmyzsh path:plugins/git
lukechilds/zsh-nvm
zsh-users/zsh-completions kind:fpath path:src
zsh-users/zsh-autosuggestions
agkozak/zsh-z
sindresorhus/pure kind:fpath
zsh-users/zsh-syntax-highlighting
