tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "jesseduffield/lazydocker"
tap "lucagrulla/tap"
# AWS Cloud Development Kit - framework for defining AWS infra as code
brew "aws-cdk"
# Official Amazon AWS command-line interface
brew "awscli"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Distributed revision control system
brew "git"
# GNU grep, egrep and fgrep
brew "grep"
# Improved top (interactive process viewer)
brew "htop"
# Securely transfers data between computers
brew "magic-wormhole"
# Open source relational database management system
brew "mysql"
# Nvm
brew "nvm"
# Object-relational database system
brew "postgresql"
# Login and retrieve AWS temporary credentials using a SAML IDP
brew "saml2aws"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# Editor of encrypted files
brew "sops"
# CLI for extracting streams from various websites to a video player
brew "streamlink"
# Terraform version manager inspired by rbenv
brew "tfenv"
# Linter for Terraform files
brew "tflint"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Language for application scale JavaScript development
brew "typescript"
# Secures, stores, and tightly controls access to secrets
brew "vault"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# A simple terminal UI for docker, written in Go
brew "jesseduffield/lazydocker/lazydocker"
# The best way to tail AWS Cloudwatch Logs from your terminal
brew "lucagrulla/tap/cw"