tap "jesseduffield/lazydocker"
tap "planetscale/tap"

# Shell
# Zsh plugin manager
brew "antidote"
# Load/unload environment variables per directory
brew "direnv"

# Git
# Distributed revision control system
brew "git"
# GitHub CLI
brew "gh"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Terminal UI for git commands
brew "lazygit"

# Node
# Node version manager
brew "nvm"
# Language for application scale JavaScript development
brew "typescript"

# AWS
# Official Amazon AWS command-line interface
brew "awscli"

# Databases
# PlanetScale CLI
brew "planetscale/tap/pscale"

# Tools
# Command-line fuzzy finder
brew "fzf"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Improved top (interactive process viewer)
brew "htop"
# Securely transfers data between computers
brew "magic-wormhole"
# Display directories as trees
brew "tree"
# Internet file retriever
brew "wget"

# Docker
# Terminal UI for docker
brew "jesseduffield/lazydocker/lazydocker"

# Terminals
# GPU-accelerated terminal emulator
cask "ghostty"

# Browsers
# Chromium-based browser
cask "arc"
# Google Chrome
cask "google-chrome"

# Dev tools
# AI-powered code editor
cask "cursor"
# Code editor
cask "visual-studio-code"
# AI code review CLI
cask "coderabbit"

# Design
# Collaborative design tool
cask "figma"

# Communication
# Team messaging
cask "slack"
# Voice and text chat
cask "discord"
# Messaging app
cask "telegram"
# Messaging app
cask "whatsapp"

# Productivity
# Application launcher
cask "alfred"
# Window switcher
cask "contexts"
# Window management
cask "rectangle"
# Project management
cask "linear-linear"
# Notes and docs
cask "notion"

# Security
# Password manager
cask "1password"

# Cloud storage
# File sync and sharing
cask "dropbox"

# Media
# Audio editor
cask "audacity"
# Music streaming
cask "spotify"
# Media player
cask "vlc"

# Utility
# Prevent Mac from sleeping
cask "keepingyouawake"

# Fonts
# Monospace font with programming ligatures
cask "font-fira-code"
